#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Plan 📖`success`
<details><summary>Show plan</summary>

```terraform

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_zone.sandbox_zone will be created
  + resource "aws_route53_zone" "sandbox_zone" {
      + comment       = "Managed by Terraform"
      + force_destroy = false
      + id            = (known after apply)
      + name          = "ssb.datagov.us"
      + name_servers  = (known after apply)
      + vpc_id        = (known after apply)
      + vpc_region    = (known after apply)
      + zone_id       = (known after apply)
    }

  # aws_route53_zone.zone will be created
  + resource "aws_route53_zone" "zone" {
      + comment       = "Managed by Terraform"
      + force_destroy = false
      + id            = (known after apply)
      + name          = "ssb.data.gov"
      + name_servers  = (known after apply)
      + vpc_id        = (known after apply)
      + vpc_region    = (known after apply)
      + zone_id       = (known after apply)
    }

  # cloudfoundry_app.ssb will be created
  + resource "cloudfoundry_app" "ssb" {
      + buildpack                  = "binary_buildpack"
      + command                    = "source .profile && ./cloud-service-broker serve"
      + disk_quota                 = 2048
      + enable_ssh                 = false
      + environment                = (sensitive value)
      + health_check_http_endpoint = (known after apply)
      + health_check_timeout       = (known after apply)
      + health_check_type          = "port"
      + id                         = (known after apply)
      + id_bg                      = (known after apply)
      + instances                  = 2
      + memory                     = 512
      + name                       = "ssb"
      + path                       = "./app.zip"
      + ports                      = (known after apply)
      + source_code_hash           = "3GGCTpBoxRtoa2jyyx/eJrHZ4OWuNn6voy0tcRFTNLI="
      + space                      = "5edc803e-3376-4788-b72c-a152f11925b0"
      + stack                      = (known after apply)
      + stopped                    = false
      + strategy                   = "blue-green"
      + timeout                    = 60

      + routes {
          + port  = (known after apply)
          + route = (known after apply)
        }

      + service_binding {
          + service_instance = (known after apply)
        }
    }

  # cloudfoundry_route.ssb_uri will be created
  + resource "cloudfoundry_route" "ssb_uri" {
      + domain   = "50ba3f69-cd54-4963-9172-14f3334b479e"
      + endpoint = (known after apply)
      + hostname = (known after apply)
      + id       = (known after apply)
      + port     = (known after apply)
      + space    = "5edc803e-3376-4788-b72c-a152f11925b0"
    }

  # cloudfoundry_service_broker.space-scoped-broker["gsa-datagov/management-staging"] will be created
  + resource "cloudfoundry_service_broker" "space-scoped-broker" {
      + catalog_change                   = false
      + catalog_hash                     = (known after apply)
      + fail_when_catalog_not_accessible = true
      + id                               = (known after apply)
      + name                             = "ssb-gsa-datagov-management-staging"
      + password                         = (sensitive value)
      + service_plans                    = (known after apply)
      + services                         = (known after apply)
      + space                            = "5edc803e-3376-4788-b72c-a152f11925b0"
      + url                              = (known after apply)
      + username                         = (known after apply)
    }

  # cloudfoundry_service_instance.db will be created
  + resource "cloudfoundry_service_instance" "db" {
      + id               = (known after apply)
      + name             = "ssb-db"
      + recursive_delete = false
      + service_plan     = "3a8e624f-ba5a-4435-8fa4-ee955b103bae"
      + space            = "5edc803e-3376-4788-b72c-a152f11925b0"
      + tags             = [
          + "mysql",
        ]
    }

  # random_password.client_password will be created
  + resource "random_password" "client_password" {
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + override_special = "_%@"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # random_pet.client_hostname will be created
  + resource "random_pet" "client_hostname" {
      + id        = (known after apply)
      + length    = 2
      + separator = "-"
    }

  # random_uuid.client_username will be created
  + resource "random_uuid" "client_username" {
      + id     = (known after apply)
      + result = (known after apply)
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + client_spaces                    = [
      + "gsa-datagov/management-staging",
    ]
  + route53_sandbox_zone_nameservers = (known after apply)
  + route53_zone_nameservers         = (known after apply)

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.


```

</details>

#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Plan 📖`success`
<details><summary>Show plan</summary>

```terraform
random_pet.client_hostname: Refreshing state... [id=deep-dingo]
random_uuid.client_username: Refreshing state... [id=a1582ac8-4a25-1669-b5ca-af0011e0ab25]
random_password.client_password: Refreshing state... [id=none]
aws_route53_zone.sandbox_zone: Refreshing state... [id=Z100993817TJFWA5QJDPB]
aws_route53_zone.zone: Refreshing state... [id=Z10387623VC2UL2NU3ZZ9]
cloudfoundry_route.ssb_uri: Refreshing state... [id=32a63578-b902-4648-92ab-5a945d16c6a1]
cloudfoundry_service_instance.db: Refreshing state... [id=3c9a0f58-c784-4f71-8872-f2052c95df43]
cloudfoundry_app.ssb: Refreshing state... [id=8189025d-5159-4e53-93d9-60a0bc24c4c5]
cloudfoundry_service_broker.space-scoped-broker["gsa-datagov/prod"]: Refreshing state... [id=a508e14d-c0d0-42b9-9904-eb3f2458b3d8]
cloudfoundry_service_broker.space-scoped-broker["gsa-datagov/development"]: Refreshing state... [id=c17a5163-fc28-4dcf-b410-6c3fb9905c5b]
cloudfoundry_service_broker.space-scoped-broker["gsa-datagov/management"]: Refreshing state... [id=e2c06bb8-665c-42d4-86e4-861ef33438e0]
cloudfoundry_service_broker.space-scoped-broker["gsa-datagov/staging"]: Refreshing state... [id=29140105-f171-46c2-9634-5dd8305223a9]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # cloudfoundry_app.ssb will be updated in-place
  ~ resource "cloudfoundry_app" "ssb" {
      ~ environment          = (sensitive value)
        id                   = "8189025d-5159-4e53-93d9-60a0bc24c4c5"
      ~ id_bg                = "8189025d-5159-4e53-93d9-60a0bc24c4c5" -> (known after apply)
        name                 = "ssb"
        # (16 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # cloudfoundry_service_broker.space-scoped-broker["gsa-datagov/development"] will be updated in-place
  ~ resource "cloudfoundry_service_broker" "space-scoped-broker" {
      ~ catalog_change                   = true -> false
        id                               = "c17a5163-fc28-4dcf-b410-6c3fb9905c5b"
        name                             = "ssb-gsa-datagov-development"
        # (8 unchanged attributes hidden)
    }

  # cloudfoundry_service_broker.space-scoped-broker["gsa-datagov/management"] will be updated in-place
  ~ resource "cloudfoundry_service_broker" "space-scoped-broker" {
      ~ catalog_change                   = true -> false
        id                               = "e2c06bb8-665c-42d4-86e4-861ef33438e0"
        name                             = "ssb-gsa-datagov-management"
        # (8 unchanged attributes hidden)
    }

  # cloudfoundry_service_broker.space-scoped-broker["gsa-datagov/prod"] will be updated in-place
  ~ resource "cloudfoundry_service_broker" "space-scoped-broker" {
      ~ catalog_change                   = true -> false
        id                               = "a508e14d-c0d0-42b9-9904-eb3f2458b3d8"
        name                             = "ssb-gsa-datagov-prod"
        # (8 unchanged attributes hidden)
    }

  # cloudfoundry_service_broker.space-scoped-broker["gsa-datagov/staging"] will be updated in-place
  ~ resource "cloudfoundry_service_broker" "space-scoped-broker" {
      ~ catalog_change                   = true -> false
        id                               = "29140105-f171-46c2-9634-5dd8305223a9"
        name                             = "ssb-gsa-datagov-staging"
        # (8 unchanged attributes hidden)
    }

Plan: 0 to add, 5 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.


```

</details>          

*Pusher: @mogul, Action: `pull_request`*